#pragma once

#include <limits.h>
#include <stdarg.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <uchar.h>

#include <libpussy/allocator.h>

#ifdef __cplusplus
extern "C" {
#endif


#define UW_LENGTH(array)  (sizeof(array) / sizeof((array)[0]))  // get array length

/****************************************************************
 * Assertions and panic
 *
 * Unlike assertions from standard library they cannot be
 * turned off and can be used for input parameters validation.
 */

#define uw_assert(condition) \
    ({  \
        if (!(condition)) {  \
            uw_panic("UW assertion failed at %s:%s:%d: " #condition "\n", __FILE__, __func__, __LINE__);  \
        }  \
    })

[[noreturn]]
void uw_panic(char* fmt, ...);

/****************************************************************
 * UwValue
 */

// Type for type id.
typedef uint16_t UwTypeId;

// Integral types
typedef nullptr_t  UwType_Null;
typedef bool       UwType_Bool;
typedef int64_t    UwType_Signed;
typedef uint64_t   UwType_Unsigned;
typedef double     UwType_Float;

#define UW_SIGNED_MAX  0x7fff'ffff'ffff'ffffL

typedef struct {
    unsigned refcount;
    uint32_t capacity;
    uint8_t data[];
} _UwStringData;

typedef struct { uint8_t v[3]; } uint24_t;  // three bytes wide characters, always little-endian

typedef struct {
    union {
        // the basic structure contains reference count only,
        unsigned refcount;

        // but we need to make sure it has correct size for proper alignmenf of subsequent structures
        void* padding;
    };
} _UwStructData;

// forward declaration
struct __UwStatusData;

// make sure largest C type fits into 64 bits
static_assert( sizeof(long long) <= sizeof(uint64_t) );

union __UwValue {
    /*
     * 128-bit value
     */

    UwTypeId /* uint16_t */ type_id;

    uint64_t u64[2];

    struct {
        // integral types
        UwTypeId /* uint16_t */ _integral_type_id;
        uint8_t carry;  // for integer arithmetic
        uint8_t  _integral_pagging_1;
        uint32_t _integral_pagging_2;
        union {
            // Integral types
            UwType_Bool     bool_value;
            UwType_Signed   signed_value;
            UwType_Unsigned unsigned_value;
            UwType_Float    float_value;
        };
    };

    struct {
        // charptr and ptr
        UwTypeId /* uint16_t */ _charptr_type_id;
        uint8_t charptr_subtype; // see UW_CHARPTR* constants
        uint8_t  _charptr_padding_1;
        uint32_t _charptr_pagging_2;
        union {
            // C string pointers for UwType_CharPtr
            char*     charptr;
            char8_t*  char8ptr;
            char32_t* char32ptr;

            // void*
            void* ptr;
        };
    };

    struct {
        // struct
        UwTypeId /* uint16_t */ _struct_type_id;
        int16_t _struct_padding1;
        uint32_t _struct_padding2;
        _UwStructData* struct_data;  // the first member of struct_data is reference count
    };

    struct {
        // status
        UwTypeId /* uint16_t */ _status_type_id;
        int16_t uw_errno;
        uint16_t line_number;   // not set for UW_SUCCESS
        union {
            uint16_t is_error;  // all bit fields are zero for UW_SUCCESS
                                // so we can avoid bit operations when checking for success
            struct {
                uint16_t status_code: 15,
                         has_status_data: 1;
            };
        };
        union {
            char* file_name;  // when has_status_data == 0, not set for UW_SUCCESS
            struct __UwStatusData* status_data;  // when has_status_data == 1
        };
    };

    struct {
        // embedded string
        UwTypeId /* uint16_t */ _emb_string_type_id;
        uint8_t str_embedded:1,       // the string data is embedded into UwValue
                str_char_size:2;
        uint8_t str_embedded_length;  // length of embedded string
        union {
            uint8_t  str_1[12];
            uint16_t str_2[6];
            uint24_t str_3[4];
            uint32_t str_4[3];
        };
    };

    struct {
        // allocated string
        UwTypeId /* uint16_t */ _string_type_id;
        uint8_t _x_str_embedded:1,   // zero for allocated string
                _x_str_char_size:2;
        uint8_t _str_padding;
        uint32_t str_length;
        _UwStringData* string_data;
    };

    struct {
        // date/time
        UwTypeId /* uint16_t */ _datetime_type_id;
        uint16_t year;
        // -- 32 bits
        uint8_t month;
        uint8_t day;
        uint8_t hour;
        uint8_t minute;
        // -- 64 bits
        uint32_t nanosecond;
        int16_t gmt_offset;  // in minutes
        uint8_t second;

        uint8_t tzindex;
        /* Index in the zone info cache.
         * If zero, zone info is undefined.
         */
    };

    struct {
        // timestamp
        UwTypeId /* uint16_t */ _timestamp_type_id;
        uint16_t _timestamp_padding;
        uint32_t ts_nanoseconds;
        uint64_t ts_seconds;
    };

};

typedef union __UwValue _UwValue;

struct __UwStatusData {
    unsigned refcount;
    unsigned line_number;
    char* file_name;
    _UwValue description;  // string
};
typedef struct __UwStatusData _UwStatusData;


// make sure _UwValue structure is correct
static_assert( offsetof(_UwValue, charptr_subtype) == 2 );

static_assert( offsetof(_UwValue, bool_value) == 8 );
static_assert( offsetof(_UwValue, charptr)    == 8 );
static_assert( offsetof(_UwValue, struct_data) == 8 );
static_assert( offsetof(_UwValue, status_data) == 8 );
static_assert( offsetof(_UwValue, string_data) == 8 );

static_assert( offsetof(_UwValue, str_embedded_length) == 3 );
static_assert( offsetof(_UwValue, str_1) == 4 );
static_assert( offsetof(_UwValue, str_2) == 4 );
static_assert( offsetof(_UwValue, str_3) == 4 );
static_assert( offsetof(_UwValue, str_4) == 4 );

static_assert( sizeof(_UwValue) == 16 );

typedef _UwValue* UwValuePtr;
typedef _UwValue  UwResult;  // alias for return values

// automatically cleaned value
#define _UW_VALUE_CLEANUP [[ gnu::cleanup(uw_destroy) ]]
#define UwValue _UW_VALUE_CLEANUP _UwValue

// Built-in types
#define UwTypeId_Null        0
#define UwTypeId_Bool        1U
#define UwTypeId_Int         2U  // abstract integer
#define UwTypeId_Signed      3U  // subtype of int, signed integer
#define UwTypeId_Unsigned    4U  // subtype of int, unsigned integer
#define UwTypeId_Float       5U
#define UwTypeId_DateTime    6U
#define UwTypeId_Timestamp   7U
#define UwTypeId_Ptr         8U  // container for void*
#define UwTypeId_CharPtr     9U  // container for pointers to static C strings
#define UwTypeId_String     10U
#define UwTypeId_Struct     11U  // the base for reference counted data
#define UwTypeId_Compound   12U  // the base for values that may contain circular references
